#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import re


unicode_es = {
    'c1': 'á',
    'c9': 'é',
    'cD': 'í',
    'd3': 'ó',
    'dA': 'ú',
    'dC': 'ü',
    'd1': 'ñ',
    'e1': 'á',
    'e9': 'é',
    'eD': 'í',
    'f3': 'ó',
    'fA': 'ú',
    'fC': 'ü',
    'f1': 'ñ',
}

unicode_ru = {
    '0410': 'А',
    '0411': 'Б',
    '0412': 'В',
    '0413': 'Г',
    '0414': 'Д',
    '0415': 'Е',
    '0416': 'Ж',
    '0417': 'З',
    '0418': 'И',
    '0419': 'Й',
    '041a': 'К',
    '041b': 'Л',
    '041c': 'М',
    '041d': 'Н',
    '041e': 'О',
    '041f': 'П',
    '0420': 'Р',
    '0421': 'С',
    '0422': 'Т',
    '0423': 'У',
    '0424': 'Ф',
    '0425': 'Х',
    '0426': 'Ц',
    '0427': 'Ч',
    '0428': 'Ш',
    '0429': 'Щ',
    '042a': 'Ъ',
    '042b': 'Ы',
    '042c': 'Ь',
    '042d': 'Э',
    '042e': 'Ю',
    '042f': 'Я',
    '0430': 'а',
    '0431': 'б',
    '0432': 'в',
    '0433': 'г',
    '0434': 'д',
    '0435': 'е',
    '0436': 'ж',
    '0437': 'з',
    '0438': 'и',
    '0439': 'й',
    '043a': 'к',
    '043b': 'л',
    '043c': 'м',
    '043d': 'н',
    '043e': 'о',
    '043f': 'п',
    '0440': 'р',
    '0441': 'с',
    '0442': 'т',
    '0443': 'у',
    '0444': 'ф',
    '0445': 'х',
    '0446': 'ц',
    '0447': 'ч',
    '0448': 'ш',
    '0449': 'щ',
    '044a': 'ъ',
    '044b': 'ы',
    '044c': 'ь',
    '044d': 'э',
    '044e': 'ю',
    '044f': 'я',
    '0450': 'ѐ',
    '0451': 'ё',
}


def convert(s, d):
    regex = r'\\x([0-9a-fA-F]{2})'
    word = re.sub(regex, lambda m: d.get(m.group(1)), s)
    return word

if __name__ == '__main__':
    with open('5_letters_es_code.txt', 'r') as infile:
        words = [convert(line.rstrip(), unicode_es) for line in infile]
    with open('5_letters_es.txt', 'w') as outfile:
        for word in words:
            outfile.write(f'{word}\n')
